Vitality-RRS-2026/VITALITY_WRO2026/source/ESP32 Code/open_challenge_inner/open_challenge_inner.ino
/* ============================================================================
   WRO Future Engineers - OPEN CHALLENGE
   3 laps, then stop in the starting section.
   ----------------------------------------------------------------------------
   HOW IT WORKS
     Straight : PD wall-follow, centred between the two side walls
     Corner   : a side sensor reads long -> turn 90 deg USING THE GYRO
     Counting : 12 corners = 3 laps
     Finish   : after corner 12, keep following the wall for FINISH_MS, stop

   WHY THE GYRO RUNS THE TURN, NOT A TIMER
     A timed turn changes with battery voltage and floor grip, so it drifts
     over 12 corners. "Turn until the gyro says 90" is the same every time.
     After each corner the heading is SNAPPED to the nearest multiple of 90,
     which stops drift accumulating across the run.

   SET TUNING_MODE 1 FIRST. The motor stays off and sensors print.
   ============================================================================ */

#include <Wire.h>
#include <ESP32Servo.h>

#define TUNING_MODE 0        // 1 = print only, no driving. 0 = run.

/* --- pins --------------------------------------------------------------- */
const int PIN_PWMA   = 25;
const int PIN_AIN1   = 26;
const int PIN_AIN2   = 27;
const int PIN_SERVO  = 14;
const int PIN_TRIG_L = 32;
const int PIN_ECHO_L = 34;
const int PIN_TRIG_R = 33;
const int PIN_ECHO_R = 35;

// Start button: one leg to GPIO 23, the other to GND.
// INPUT_PULLUP means the pin reads HIGH when released, LOW when pressed,
// so no external resistor is needed.
const int PIN_START_BUTTON = 23;

/* --- tuning ------------------------------------------------------------- */
const int   SERVO_CENTER = 90;     // YOUR measured straight-ahead value

// Set to 1 if the robot steers the WRONG WAY.
// Depending on how the linkage is assembled and which way the servo horn
// was pressed on, increasing the servo angle may turn the wheels left on
// one build and right on another. This flips it in software instead of
// making you rebuild the linkage.
#define STEER_INVERT 1

// Set to 1 if yaw counts the WRONG WAY.
// The turn logic assumes yaw INCREASES when the robot turns right. Whether
// that is true depends on which way up the MPU6050 is mounted. If it is
// inverted, a right turn drives yaw away from its target and the robot
// turns forever.
//
// HOW TO CHECK: run with TUNING_MODE 1, rotate the robot clockwise by hand
// (viewed from above) and watch yaw in the telemetry. It must go UP.
#define GYRO_INVERT 1
// SERVO STALL WARNING. Two servos were destroyed at 60 degrees by
// stalling against the linkage's mechanical stop - the servo pushes at
// near stall current until the windings overheat, which takes several
// runs to kill it, so it looks fine until suddenly it is not.
//
// Currently set to 50. Verify with servo_sweep.ino that the linkage does
// not bind before this angle, and check the servo by hand after each run:
// warm is normal, too hot to hold comfortably means it is stalling.
const int   STEER_MAX    = 50;     // max deviation either side
const int   STEER_LOCK   = 50;     // deviation used during a corner

const int   SPEED_STRAIGHT = 125;
const int   SPEED_TURN     = 100;   // must be above your motor deadband

// Wall following
const float KP_WALL = 0.55f;
const float KD_WALL = 0.25f;
const float TARGET_SIDE_CM = 50.0f;   // used before the direction is known

/* --- inner wall following ------------------------------------------------
   Once the first corner tells us the direction, we stop centring between
   the walls and hold a fixed distance from the INNER wall instead.

   WHY THIS DISTANCE: on a rectangular track an arc of radius R centred on
   the inner corner vertex is tangent to both walls at distance R. Holding
   R from the inner wall along the straight means the robot can turn at its
   natural radius and come out parallel to the next wall at the same
   distance, with no correction needed afterwards.

   Set it to your MEASURED turning radius (square_test.ino reports it from
   encoder arc length and gyro angle). Estimate at STEER_LOCK 50: ~24 cm.
   ------------------------------------------------------------------------ */
const float INNER_FOLLOW_CM = 24.0f;

/* --- turn abort ----------------------------------------------------------
   A turn is abandoned if the robot closes on the inner wall, or swings so
   wide the outer wall is nearly out of reach. Either means the turn is
   going wrong and continuing it ends in a wall. Break off, steer clear,
   and let the corner be detected again from a better position.
   ------------------------------------------------------------------------ */
const float ABORT_INNER_CM  = 10.0f;   // too close to the inside
const float ABORT_OUTER_CM  = 85.0f;   // swung too far out
const int   ESCAPE_STEER    = 20;      // degrees away from the inner wall
const unsigned long ESCAPE_MS = 400;   // how long to hold the escape



// Corner detection
const float CORNER_DIST_CM   = 120.0f;  // side reading above this = no wall
const int   CORNER_CONFIRM   = 3;       // consecutive readings needed (2 = ~80ms delay)

/* A reading of 200 can mean two very different things:
     - genuinely nothing there              (a real corner)
     - the pulse hit a wall at a steep angle and reflected away
   The second is what makes a crooked robot turn into a wall.

   A real long reading (say 140 cm, a proper echo from across the track)
   is trustworthy after CORNER_CONFIRM. A no-echo needs this many instead,
   because it has to persist to be believed. At ~40ms per sensor refresh,
   7 confirmations is about 280ms - long enough that a momentary bad angle
   passes, short enough not to miss a corner.                            */
const int   NOECHO_CONFIRM   = 6;

const float TURN_ANGLE       = 90.0f;

/* A turn may finish once yaw is within this many degrees of the target.

   At 30 this is a LARGE tolerance: a 90 degree turn can end after only 60
   degrees of sweep. That is deliberate - it stops the robot over-rotating
   - but it means each corner may leave the robot up to 30 degrees short.

   Two things keep that from compounding:
     - the both-walls check below usually ends the turn on real alignment
       rather than on this tolerance
     - the next corner targets an ABSOLUTE heading, so a short turn is
       corrected by the following one rather than accumulating           */
const float TURN_TOLERANCE_DEG = 30.0f;

/* Seeing a wall on BOTH sides again means the robot is back in a corridor,
   i.e. the turn is done - regardless of what the gyro thinks. This is an
   independent confirmation that does not accumulate drift. It is only
   trusted once the robot has already swept most of the turn, so that the
   corridor it came FROM cannot end the turn immediately. */
const float BOTH_WALLS_MIN_SWEEP = 65.0f;

