Vitality-RRS-2026/VITALITY_WRO2026/source/ESP32 Code/open_challenge_inner/open_challenge_inner.ino
// Consecutive confirmations before trusting the both-walls reading.
const int   CORRIDOR_CONFIRM  = 3;

/* Acceptable range for a commanded turn. Every corner on this track is 90
   degrees; the self-correcting heading target may legitimately ask for a
   bit more or less to straighten the robot up, but never double. Outside
   this band the rounding has gone wrong and we fall back to a plain 90. */
const float TURN_SWEEP_MIN   = 40.0f;
const float TURN_SWEEP_MAX   = 140.0f;
const unsigned long MIN_CORNER_GAP_MS = 1200;

// Gyro bias samples, 2ms each. Runs after the button, so it costs run time.
const int   GYRO_CAL_SAMPLES = 800;   // 1.6 s

// A 90 degree turn should take well under this. Exceeding it means
// something is wrong, so the robot stops instead of circling.
const unsigned long TURN_TIMEOUT_MS = 4000;



// Run length
const int   TOTAL_CORNERS = 12;         // 4 per lap x 3 laps
const unsigned long FINISH_MS = 500;   // TUNE: drive time after last corner

const float US_MAX_CM = 200.0f;
const unsigned long US_TIMEOUT_US = 12000;
const int MPU_ADDR = 0x68;

/* --- globals ------------------------------------------------------------ */
Servo steer;
float distL = US_MAX_CM, distR = US_MAX_CM;
float yaw = 0, gyroBias = 0, headingTarget = 0;
float prevError = 0;
int   cornerCount = 0;
int   longL = 0, longR = 0;
bool  noEchoL = false, noEchoR = false;
int   corridorCount = 0;
int   usTurn = 0;
int   turnDir = 0;                 // +1 right, -1 left. Set at first corner.
unsigned long lastLoop = 0, finishStart = 0, turnStartMs = 0;
unsigned long lastYawUs = 0;
float turnStartYaw = 0;
unsigned long lastCornerMs = 0;
unsigned long escapeStart = 0;

enum State { WAIT, DRIVE, TURNING, ESCAPE, FINISHING, DONE };
State state = WAIT;

/* --- MPU6050 ------------------------------------------------------------ */
void mpuInit() {
  Wire.begin(21, 22);
  Wire.setClock(400000);
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x6B); Wire.write(0x00); Wire.endTransmission();
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x1B); Wire.write(0x00); Wire.endTransmission();
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x1A); Wire.write(0x03); Wire.endTransmission();
}
/* Reads the gyro's Z rate. Tracks consecutive failures so the rest of the
   program can fall back to timed turns instead of stalling forever. */
float gyroRaw() {
  Wire.beginTransmission(MPU_ADDR); Wire.write(0x47);
  Wire.endTransmission(false);
  Wire.requestFrom(MPU_ADDR, 2, true);
  if (Wire.available() < 2) return 0;
  int16_t v = (Wire.read() << 8) | Wire.read();
  return (float)v;
}
/* Measures the gyro's resting offset so it can be subtracted from every
   later reading.

   TIMING NOTE: this now runs AFTER the start button, so it is inside the
   scored run. At 2ms per sample, GYRO_CAL_SAMPLES directly sets how much
   dead time you spend before moving:

       400 samples  = 0.8 s   noisier bias, more heading drift per lap
       800 samples  = 1.6 s   good compromise (default)
      1500 samples  = 3.0 s   best bias, 3 s of your round gone

   The round is 3 minutes, so this is not critical, but it is free lap time
   if your gyro is well behaved. Check the printed bias across several runs:
   if it varies by more than about 5 counts, raise the sample count. */
void calibrateGyro() {
  Serial.println(F("gyro cal - HOLD STILL"));
  double s = 0;
  for (int i = 0; i < GYRO_CAL_SAMPLES; i++) { s += gyroRaw(); delay(2); }
  gyroBias = s / (double)GYRO_CAL_SAMPLES;
  Serial.print(F("bias ")); Serial.println(gyroBias, 1);
}
void updateYaw(float dt) {
  float r = (gyroRaw() - gyroBias) / 131.0f;
  if (fabs(r) < 0.6f) r = 0;
#if GYRO_INVERT
  r = -r;
#endif
  yaw += r * dt;
}

/* --- ultrasonic --------------------------------------------------------- */
/* Set true when the last ping TIMED OUT rather than returning a real
   echo. A timeout is ambiguous - it can mean "no wall" or "the pulse hit
   the wall at an angle and reflected away" - so the caller treats it with
   more suspicion than a genuine long reading. */
bool lastPingTimedOut = false;

float ping(int trig, int echo) {
  digitalWrite(trig, LOW);  delayMicroseconds(3);
  digitalWrite(trig, HIGH); delayMicroseconds(10);
  digitalWrite(trig, LOW);
  unsigned long us = pulseIn(echo, HIGH, US_TIMEOUT_US);

  /* pulseIn returns 0 when it TIMES OUT - no echo came back within 12ms,
     which is about 2 metres. That means nothing is in range, i.e. FAR.
     Being too close does not cause a timeout; it produces a very short
     pulse and reads as a small number.

     So 0 must map to US_MAX_CM, not to 0. Returning 0 would tell the wall
     follower a wall is touching the robot, and would stop the
     distL >= CORNER_DIST_CM test from ever being true, which disables
     side-based corner detection entirely. */
  if (us == 0) { lastPingTimedOut = true; return US_MAX_CM; }
  lastPingTimedOut = false;
  float cm = us / 58.0f;
  return (cm > US_MAX_CM) ? US_MAX_CM : cm;
}

/* One sensor per loop, alternating. Firing both at once means each hears
   the other's echo. Each sensor refreshes every 2 loops, about 40ms. */
void updateUltrasonics() {
  if (usTurn == 0) { distL = ping(PIN_TRIG_L, PIN_ECHO_L); noEchoL = lastPingTimedOut; }
  else             { distR = ping(PIN_TRIG_R, PIN_ECHO_R); noEchoR = lastPingTimedOut; }
  usTurn ^= 1;
}

/* --- actuators ---------------------------------------------------------- */
void motor(int s) {
#if TUNING_MODE
  s = 0;
#endif
  s = constrain(s, -255, 255);
  digitalWrite(PIN_AIN1, s > 0 ? HIGH : LOW);
  digitalWrite(PIN_AIN2, s < 0 ? HIGH : LOW);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(PIN_PWMA, abs(s));
#else
  ledcWrite(0, abs(s));
#endif
}
void steerTo(float dev) {
#if STEER_INVERT
  dev = -dev;
#endif
  dev = constrain(dev, -STEER_MAX, STEER_MAX);
  steer.write(SERVO_CENTER + (int)dev);
}

/* Which sensor faces the inner wall depends on travel direction.
   Clockwise (turnDir +1) puts the inner wall on the RIGHT. Meaningless
   before the direction is known, so callers must check turnDir first. */
float innerDist() { return (turnDir > 0) ? distR : distL; }
float outerDist() { return (turnDir > 0) ? distL : distR; }

/* --- wall following ----------------------------------------------------- */
float wallSteer() {
  bool seeL = distL < CORNER_DIST_CM;
  bool seeR = distR < CORNER_DIST_CM;
  float error;

  if (turnDir == 0) {
    // Direction unknown - centre between whatever walls are visible
    if (seeL && seeR)      error = distR - distL;
    else if (seeL)         error = TARGET_SIDE_CM - distL;
    else if (seeR)         error = distR - TARGET_SIDE_CM;
    else                   return 1.2f * (headingTarget - yaw);
  } else {
    /* Direction known - hold INNER_FOLLOW_CM from the inner wall.

       Following one wall beats centring: the outer wall is far away so its
       reading is noisier, and holding the turn radius from the inner wall
       lines the robot up for the next corner automatically. */
    float inner = innerDist();
    if (inner < CORNER_DIST_CM) {
      // Positive error must mean "steer right".
      error = (turnDir > 0) ? (inner - INNER_FOLLOW_CM)
                            : (INNER_FOLLOW_CM - inner);
    } else if (outerDist() < CORNER_DIST_CM) {
      float outer = outerDist();       // inner wall lost - fall back
      error = (turnDir > 0) ? (TARGET_SIDE_CM - outer)
                            : (outer - TARGET_SIDE_CM);
    } else {
      return 1.2f * (headingTarget - yaw);
    }
  }

  float d = error - prevError;
  prevError = error;
  return KP_WALL * error + KD_WALL * d;
}


/* How far the robot is from its nearest legal heading (a multiple of 90).
   Every heading on a rectangular track is a multiple of 90, so this is a
   useful measure of how crooked the robot is running. Telemetry only -
   it does not gate any decision. */
float headingError() {
  return fabs(yaw - round(yaw / 90.0f) * 90.0f);
}

