Vitality-RRS-2026/VITALITY_WRO2026/source/ESP32 Code/open_challenge_inner/open_challenge_inner.ino
/* Returns true only on a clean press.

   WHY DEBOUNCE: a mechanical switch bounces for a few milliseconds when
   pressed, which reads as many separate presses. Requiring the pin to stay
   LOW for 30ms filters that out. */
bool startPressed() {
  static unsigned long downSince = 0;
  if (digitalRead(PIN_START_BUTTON) == LOW) {
    if (downSince == 0) downSince = millis();
    if (millis() - downSince >= 30) return true;
  } else {
    downSince = 0;
  }
  return false;
}

/* --- setup ---------------------------------------------------------------

   ORDER MATTERS HERE.

   Only the minimum needed to sit safely still happens before the button:
   pin directions, actuators parked, I2C awake. Everything that actually
   prepares the robot to run - gyro calibration above all - happens AFTER
   the press.

   Why: the gyro bias must be measured while the robot is stationary and in
   its final position. If we calibrated at power-up, any nudge while placing
   the robot on the mat would corrupt the bias, and every corner afterwards
   would inherit that error.
   -------------------------------------------------------------------------- */
void setup() {
  Serial.begin(115200);
  delay(400);

  /* ---- minimal init: make everything safe and idle ---- */

  // Servo timers FIRST. If the motor PWM claims a timer first, the servo
  // silently fails to attach and never moves.
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  steer.setPeriodHertz(50);
  steer.attach(PIN_SERVO, 500, 2400);
  steerTo(0);

  pinMode(PIN_AIN1, OUTPUT);
  pinMode(PIN_AIN2, OUTPUT);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(PIN_PWMA, 20000, 8);
#else
  ledcSetup(0, 20000, 8);
  ledcAttachPin(PIN_PWMA, 0);
#endif
  motor(0);                       // motor parked before anything else runs

  pinMode(PIN_TRIG_L, OUTPUT); pinMode(PIN_ECHO_L, INPUT);
  pinMode(PIN_TRIG_R, OUTPUT); pinMode(PIN_ECHO_R, INPUT);
  pinMode(PIN_START_BUTTON, INPUT_PULLUP);

  mpuInit();                      // just wakes the chip over I2C, no measuring

  /* ---- WAIT FOR THE BUTTON ---- */
  // WRO rules: one switch powers the robot on, a SEPARATE button starts the
  // program. Auto-starting on a timer is a rule violation.
  Serial.println(F("\nREADY - press start button"));
  while (!startPressed()) {
    motor(0);
    steerTo(0);
    delay(10);
  }

  // Wait for release so one long press cannot be read as a second press
  // later in the run.
  while (digitalRead(PIN_START_BUTTON) == LOW) delay(10);

  Serial.println(F("GO"));

  /* ---- everything else happens AFTER the press ---- */
  calibrateGyro();                // robot must be still - it already is
  yaw = 0;                        // heading zero = straight ahead from here
  headingTarget = 0;
  prevError = 0;
  cornerCount = 0;
  longL = longR = 0;
  turnDir = 0;

  lastLoop = millis();
  lastYawUs = micros();

#if TUNING_MODE
  Serial.println(F("TUNING MODE - motor disabled"));
#endif
  state = DRIVE;
}

/* --- loop --------------------------------------------------------------- */
void loop() {
  /* GYRO FIRST, EVERY ITERATION.

     pulseIn() blocks for up to 12ms when a sensor gets no echo, so the old
     fixed 20ms loop could stretch to 40ms or more. The gyro was sampled
     once per loop, which meant integrating at an irregular 25-50Hz and
     applying each rate reading across the whole gap. That is why turns came
     out inconsistent - sometimes over, sometimes under.

     Now yaw integrates as fast as the loop can run, using real elapsed
     micros, and the slow sensor work is throttled separately below.     */
  unsigned long nowUs = micros();
  float dt = (nowUs - lastYawUs) / 1000000.0f;
  lastYawUs = nowUs;
  if (dt > 0.2f) dt = 0.2f;            // ignore absurd gaps after a stall
  updateYaw(dt);

  unsigned long now = millis();
  if (now - lastLoop < 20) return;
  lastLoop = now;

  /* Ultrasonics are skipped during the FIRST part of a turn: they are not
     needed there, and pulseIn blocking would thin out the gyro sampling
     exactly when the turn accuracy depends on it.

     Once the robot has swept past BOTH_WALLS_MIN_SWEEP they come back on, so
     the early-exit check below has data to work with. */
  /* Sensors run CONTINUOUSLY, including during turns - they are needed
     mid-turn to abort if the robot closes on the inner wall or swings too
     wide. Yaw integrates every loop iteration above, before this throttled
     section, so the blocking pulseIn calls do not starve it. */
  updateUltrasonics();

  // Debounced "wall has gone" detection
  if (distL >= CORNER_DIST_CM) longL++; else longL = 0;
  if (distR >= CORNER_DIST_CM) longR++; else longR = 0;

  /* A no-echo reading has to persist longer before it is believed.

     A reading of 200 means either "genuinely nothing there" (a real
     corner) or "the pulse hit a wall at a steep angle and reflected
     away". The second is what makes a crooked robot turn into a wall, so
     a timeout needs NOECHO_CONFIRM readings while a real long echo - a
     proper reflection from across the track - needs only CORNER_CONFIRM. */
  int needL = noEchoL ? NOECHO_CONFIRM : CORNER_CONFIRM;
  int needR = noEchoR ? NOECHO_CONFIRM : CORNER_CONFIRM;

  switch (state) {

    case WAIT:                  // safe idle - not used in normal flow,
      motor(0);                 // the button wait now happens in setup()
      steerTo(0);
      break;

    case DRIVE: {
      steerTo(wallSteer());
      motor(SPEED_STRAIGHT);

      /* CORNER DETECTION: a side wall disappearing.

         The exclusivity check - one side long while the other is NOT -
         stops an open area on both sides from triggering a random turn. */
      bool cornerL = (longL >= needL) && (longR < needR);
      bool cornerR = (longR >= needR) && (longL < needL);

      // Corners are physically far apart, so a detection too soon after
      // the last one is spurious. This guard does not depend on any sensor
      // being accurate, unlike a heading-based check.
      bool spacedOut = (millis() - lastCornerMs) > MIN_CORNER_GAP_MS;

      if ((cornerL || cornerR) && spacedOut) {
        // Lap direction is decided by the FIRST corner, because the start
        // direction is randomised. Do not assume clockwise.
        if (turnDir == 0) {
          turnDir = cornerL ? -1 : +1;
          Serial.print(F("direction: "));
          Serial.println(turnDir > 0 ? F("clockwise") : F("anticlockwise"));
        }
        // ABSOLUTE heading target, not a relative sweep.
        //
        // The track is a rectangle, so every legal heading is a multiple
        // of 90 degrees. round(yaw/90)*90 gives the heading we SHOULD have
        // been on; adding 90 in the turn direction gives the heading we
        // should end up on.
        //
        // This self-corrects. Entering a corner 30 degrees crooked means
        // the robot turns 60 or 120 degrees as needed to come out straight,
        // instead of turning a blind 90 and staying 30 degrees off.
        /* Absolute heading target, with a sanity clamp.

           round(yaw/90) self-corrects small heading errors, which is what
           we want. But it has a cliff: once the robot is more than 45
           degrees off, round() snaps to the WRONG multiple of 90 and the
           commanded turn jumps by a full 90 degrees. Measured: at yaw -134
           the sweep is 46 degrees; at -136 it becomes 136 degrees.

           So compute the target, then check how far it actually asks the
           robot to turn. A corner on this track is 90 degrees. Anything
           outside a sensible band means the rounding went over the cliff,
           and we fall back to a plain 90 from the current heading.       */
        headingTarget = round(yaw / 90.0f) * 90.0f + turnDir * TURN_ANGLE;

        float sweep = fabs(headingTarget - yaw);
        if (sweep < TURN_SWEEP_MIN || sweep > TURN_SWEEP_MAX) {
          Serial.print(F("  sweep ")); Serial.print(sweep, 0);
          Serial.println(F(" deg out of range - using plain 90"));
          headingTarget = yaw + turnDir * TURN_ANGLE;
        }
        turnStartMs = millis();
        turnStartYaw = yaw;
        corridorCount = 0;
        lastCornerMs = millis();
        state = TURNING;
        Serial.print(F("corner ")); Serial.println(cornerCount + 1);
      }
      break;
    }

    case TURNING: {
      steerTo(turnDir * STEER_LOCK);
      motor(SPEED_TURN);

