Vitality-RRS-2026/VITALITY_WRO2026/source/ESP32 Code/open_challenge_inner/open_challenge_inner.ino
      float swept = fabs(yaw - turnStartYaw);

      /* Two independent ways to finish a turn.

         1. GYRO - yaw within TURN_TOLERANCE_DEG of the target, or past it.
            Tolerance matters because tyre scrub or a brush against a wall
            can eat the last few degrees; without it the turn hangs until
            the timeout and the corner never gets counted.

         2. BOTH WALLS - a wall visible on both sides means the robot is
            back in a corridor and pointing down it. That is physical
            evidence of alignment, so it ends the turn whatever the gyro
            says. Valuable precisely because it does NOT drift: if the gyro
            is slowly accumulating error, the walls still tell the truth.

            Only trusted after BOTH_WALLS_MIN_SWEEP degrees, otherwise the
            corridor the robot came FROM would end the turn immediately.
            Confirmed over several readings, since ultrasonics mis-read.

            When the walls end the turn, yaw is set to the target - the
            walls say we ARE aligned, so this is an evidence-based
            correction rather than a blind snap.                          */
      bool byGyro = fabs(yaw - headingTarget) <= TURN_TOLERANCE_DEG;
      if (turnDir > 0 && yaw >= headingTarget) byGyro = true;
      if (turnDir < 0 && yaw <= headingTarget) byGyro = true;

      bool byWalls = false;
      if (!byGyro && swept >= BOTH_WALLS_MIN_SWEEP) {
        /* The OUTER sensor verifies completion. Coming out of a corner it
           is the wall that returns to a sensible distance; the inner wall
           is close and its reading is dominated by the corner itself. */
        if (outerDist() < CORNER_DIST_CM) corridorCount++;
        else                              corridorCount = 0;

        if (corridorCount >= CORRIDOR_CONFIRM) {
          Serial.print(F("  corridor found at yaw ")); Serial.print(yaw, 0);
          Serial.print(F(" (target ")); Serial.print(headingTarget, 0);
          Serial.print(F("), swept ")); Serial.print(swept, 0);
          Serial.println(F(" deg - ending turn"));
          yaw = headingTarget;
          byWalls = true;
        }
      }

      bool reached = byGyro || byWalls;

      /* ABORT: inner distance below ABORT_INNER_CM means the robot is
         about to clip the inside of the corner; outer above
         ABORT_OUTER_CM means it has swung too wide. Either way the turn
         is failing, so break off rather than drive into a wall. */
      if (!reached && turnDir != 0) {
        float inner = innerDist();
        float outer = outerDist();
        if (inner < ABORT_INNER_CM || outer > ABORT_OUTER_CM) {
          Serial.print(F("  !! TURN ABORT inner=")); Serial.print(inner, 0);
          Serial.print(F(" outer=")); Serial.println(outer, 0);
          escapeStart = millis();
          state = ESCAPE;
          break;
        }
      }

      // SAFETY: a turn should never take more than a few seconds. If it
      // does, the gyro sign is likely wrong - see GYRO_INVERT.
      if (!reached && millis() - turnStartMs > TURN_TIMEOUT_MS) {
        motor(0);
        steerTo(0);
        Serial.println(F("!! TURN TIMEOUT - check GYRO_INVERT"));
        Serial.print(F("   yaw=")); Serial.print(yaw, 1);
        Serial.print(F(" target=")); Serial.println(headingTarget, 1);
        state = DONE;
        break;
      }

      if (reached) {
        // NOTE: we deliberately do NOT snap yaw to a multiple of 90 here.
        // Snapping made the numbers look clean while leaving the robot
        // physically crooked, and the error compounded corner after corner.
        // Because the next turn targets an absolute heading, any residual
        // error is corrected by the turn itself.
        headingTarget = round(yaw / 90.0f) * 90.0f;
        lastCornerMs = millis();      // gap measured from turn EXIT
        prevError = 0;
        longL = longR = 0;
        corridorCount = 0;

        /* INVALIDATE STALE DISTANCES.

           Ultrasonics are skipped during most of a turn, so these values
           can still describe the corner the robot just came out of. Acting
           on them in DRIVE made the robot clamp its steering as if a wall
           were still close ahead, so it could not correct its line and
           drove into the wall.

           Setting them to maximum means "unknown, assume clear" until a
           real reading arrives, which takes about 60ms. */
        distL = distR = US_MAX_CM;
        cornerCount++;

        if (cornerCount >= TOTAL_CORNERS) {
          finishStart = millis();
          state = FINISHING;
          Serial.println(F("3 laps done - heading to start section"));
        } else {
          state = DRIVE;
        }
      }
      break;
    }

    /* ESCAPE: steer away from the inner wall briefly after an aborted
       turn, then resume. The corner counter is NOT incremented - the
       corner was not completed, so it gets detected again once clear. */
    case ESCAPE: {
      int away = (turnDir > 0) ? -ESCAPE_STEER : ESCAPE_STEER;
      steerTo(away);
      motor(SPEED_TURN);
      if (millis() - escapeStart >= ESCAPE_MS) {
        prevError = 0;
        longL = longR = 0;
        corridorCount = 0;
        lastCornerMs = millis();
        state = DRIVE;
        Serial.println(F("  escape done, resuming"));
      }
      break;
    }

    case FINISHING:
      steerTo(wallSteer());
      motor(SPEED_STRAIGHT);
      if (millis() - finishStart >= FINISH_MS) {
        motor(0); steerTo(0);
        state = DONE;
        Serial.println(F("STOPPED"));
      }
      break;

    case DONE:
      motor(0);
      steerTo(0);
      break;

    default:
      motor(0);
      break;
  }

  static uint8_t n = 0;
  if (++n >= 5) {
    n = 0;
    Serial.print(F("L=")); Serial.print(distL, 0);
    if (noEchoL) Serial.print(F("*"));
    Serial.print(F(" R=")); Serial.print(distR, 0);
    if (noEchoR) Serial.print(F("*"));
    Serial.print(F(" yaw=")); Serial.print(yaw, 0);
    Serial.print(F(" err=")); Serial.print(headingError(), 0);
    if (turnDir != 0) {
      Serial.print(F(" in=")); Serial.print(innerDist(), 0);
      Serial.print(F(" out=")); Serial.print(outerDist(), 0);
    }
    Serial.print(F(" corners=")); Serial.print(cornerCount);
    Serial.print(F(" state=")); Serial.println((int)state);
  }
}
